<template>
    <div class="w-full px-2 mb-10 md:px-60">
        <div @click="onPrev"  class="flex  cursor-pointer text-primary py-6 items-center">
            <i class="flex-1  fas fa-angle-left -mt-1 text-4xl mr-24"></i>
            <div class="flex  w-full -ml-40 justify-center text-xl font-semibold">서비스 이용약관</div>
        </div>
        <div class="text-sm text-gray-500 px-2 md:px-0 space-y-10">
            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 1 조 (목적)</div>
                <div>본 약관은 빅웨이브 주식회사(이하 "회사")가 제공하는 ‘아이백 서비스의 이용과 관련하여 "회사"와 회원간의 권리, 의무 및 책임사항 기타 필요한 사항을 규정함을 목적으로 한다.</div>
            </div>

             <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 2 조 (용어의 정의)</div>
                <div>이 약관에서 사용하는 용어의 정의는 아래와 같다.</div>
                <div>1. "서비스"라 함은 PC, TV, 휴대용 단말기 등 각종 유무선 기기 또는 프로그램을 통하여 이용할 수 있도록 "회사"가 제공하는 모든 인터넷 서비스를 말하며, "회사"가 공개한 API를 이용하여 제3자가 개발 또는 구축한 프로그램이나 서비스를 통하여 이용 고객 또는 회원에게 제공되는 경우를 포함한다.</div>
                <div>2. "회원"이란 이 약관에 동의하고 "회사"가 운영하는 "사이트"에서 "서비스"를 제공받는 자를 말한다.</div>
                <div>3. "아이디"라 함은 회원의 식별과 회원의 서비스 이용을 위하여 "회원"이 가입 시 사용한 소셜미디어 이메일 주소를 말한다.</div>
                <div>4. "비밀번호"라 함은 "회사"의 서비스를 이용하려는 사람이 아이디를 부여 받은 자와 동일인임을 확인하고 "회원"의 권익을 보호하기 위하여 "회원"이 선정한 문자와 숫자의 조합을 말한다.</div>
                <div>5. "비회원"이라 함은 "회원"에 가입하지 않고 "회사"가 제공하는 서비스를 이용하는 자를 말한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 3 조 (약관의 명시와 개정)</div>
                <div>1. "회사"는 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 등을 "회원"이 알 수 있도록 초기 화면에 게시하거나 기타의 방법으로 "회원"에게 공지해야 한다.</div>
                <div>2. "회사"는 약관의 규제관한법률, 전기통신기본법, 전기통신사업법, 정보통신망법, 통신비밀보호법 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있다.</div>
                <div>3. “회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 15일 전부터 적용일자 전일까지 공지한다. 다만, “회원”에게 불리한 약관의 개정의 경우에는 공지 외에 일정기간 서비스 내 전자우편, 로그인 시 동의 창 등의 전자적 수단을 통해 따로 명확히 통지하도록 한다.</div>
                <div>4. "회사"가 전항에 따라 개정약관을 공지 또는 통지하면서 회원에게 개정약관 시행일로부터 7일 기간 내에 거부 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 본다.</div>
                <div>5. "회원"이 개정약관의 적용에 동의하지 않는 경우 "회사"는 개정 약관의 내용을 적용할 수 없으며, 이 경우 "회원"은 이용계약을 해지할 수 있다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 "회사"는 이용계약을 해지할 수 있다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 4 조 (약관의 해석)</div>
                <div>1. 이 약관에서 규정하지 않은 사항에 관해서는 약관의 규제에 관한법률, 전기통신기본법, 정보통신망법 등의 관계법령 또는 상관례에 따른다.</div>
                <div>2. "회원"이 "회사"와 개별 계약을 체결하여 서비스를 이용하는 경우에는 개별 서비스 계약이 우선한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 5 조 (이용계약의 성립)</div>
                <div>1. "회사"의 서비스 이용계약(이하 "이용계약")은 "회원"이 되고자 하는 자(이하 "가입신청자")가 본 약관과 개인정보처리방침을 읽고 그 내용에 대하여 동의를 한 다음 회원가입 신청을 하고 "회사"가 이러한 신청에 승낙함으로써 성립된다.</div>
                <div>2. 제1항 신청에 있어 "회사"는 "회원"의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있다. "회원"은 본인 인증에 필요한 이름, 연락처, 메일주소 등을 제공하여야 한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 6 조 (이용신청의 승낙과 제한)</div>
                <div>1. "회사"는 전조의 규정에 의한 "가입신청자"의 가입신청에 대하여 업무수행상 또는 기술상 지장이 없는 경우에는 원칙적으로 접수 순서에 따라 서비스 이용을 승낙한다.</div>
                <div>2. "회사"는 아래 사항에 해당하는 경우에 대해서는 이용 신청을 승낙하지 아니한다. 가. 실명이 아니거나 타인의 명의를 이용하여 신청한 경우 나. 회원가입 신청서 내용을 허위로 기재한 경우</div>
                <div>3. "회사"는 아래 사항에 해당하는 경우에는 그 신청에 대하여 승낙 제한 사유가 해소될 때까지 승낙을 유보할 수 있다. 가. "회사"가 설비의 여유가 없는 경우 나. "회사"의 기술상 지장이 있는 경우 다. 기타 "회사"의 귀책 사유로 이용 승낙이 곤란한 경우</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 7 조 (서비스의 내용)</div>
                <div>1. "회사"가 "회원"에게 제공하는 서비스의 내용은 다음 각 호와 같다. 가. 웰다잉 매뉴얼 리스트 작성과 관련된 제반 서비스 나. 음성 유언장 작성과 관련된 제반 서비스 다. 웰다잉 매뉴얼 리스트 및 음성유언장을 “회원”이 지정한 대리인에게 접근권을 부여하는 행위와 관련된 제반 서비스 라. 기타 "회사"가 추가 개발하거나 제휴 계약 등을 통해 "회원"에게 제공하는 일체의 서비스</div>
                <div>2. "회사"는 필요한 경우 서비스의 내용을 추가 또는 변경할 수 있다. 단, 이 경우 "회사"는 추가 또는 변경내용을 "회원"에게 공지해야 한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 8 조 (서비스 이용시간)</div>
                <div>"회사"는 특별한 사유가 없는 한 연중무휴, 1일 24시간 서비스를 제공한다. 다만, "회사"는 서비스의 종류나 성질에 따라 제공하는 서비스 중 일부에 대해서는 별도로 이용시간을 정할 수 있으며, 이 경우 "회사"는 그 이용시간을 사전에 "회원"에게 공지 또는 통지하여야 한다.</div>
                <div>"회사"는 자료의 가공과 갱신을 위한 시스템 작업시간, 장애해결을 위한 보수작업 시간, 회선 장애 등이 발생한 경우 일시적으로 서비스를 중단할 수 있으며 계획된 작업의 경우 공지란에 서비스 중단 시간과 작업 내용을 알려야 한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 9 조 (서비스 제공의 중지)</div>
                <div>"회사"는 다음 각 호에 해당하는 경우 서비스의 제공을 중지할 수 있다.</div>
                <div>1. 설비의 보수 등 "회사"의 필요에 의해 사전에 "회원"들에게 통지한 경우</div>
                <div>2. 기간통신사업자가 전기통신서비스 제공을 중지하는 경우</div>
                <div>3. 기타 불가항력적인 사유에 의해 서비스 제공이 객관적으로 불가능한 경우</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 10 조 ("회원"에 대한 통지와 공지)</div>
                <div>1. "회사"가 "회원"에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 회원의 등록된 전자우편 주소로 이메일을 통하여 할 수 있다.</div>
                <div>2. "회사"는 "회원" 전체에 대한 통지의 경우 7일 이상 "회사"의 공지란에 공지하거나 서비스 첫 화면에 게시함으로써 제1항의 통지에 갈음할 수 있다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 11 조 (정보의 제공 및 광고의 게재)</div>
                <div>1. "회사"는 "회원"에게 서비스 이용에 필요가 있다고 인정되거나 서비스 개선 및 회원대상의 서비스 소개 등의 목적으로 하는 각종 정보를 공지사항이나 서비스 화면, 이메일, SNS알림, 푸시 알림 등을 이용한 방법으로 제공할 수 있다.</div>
                <div>2. "회사"는 제공하는 서비스와 관련되는 정보 또는 광고를 서비스 화면, 홈페이지 등에 게재할 수 있으며, "회원"들에게 전자우편을 통해 알릴 수 있다. 다만, “회원”은 관련법에 따른 거래관련 정보 및 고객문의 등에 답변 등을 제외하고는 언제든지 전자우편에 대해서 수신 거절을 할 수 있다.</div>
                <div>3. "회사"는 서비스상에 게재되어 있거나 본 서비스를 통한 광고주의 판촉활동에 "회원"이 참여하거나 교신 또는 거래를 함으로써 발생하는 모든 손실과 손해에 대해 책임을 지지 않는다.</div>
                <div>4. "회원"은 서비스 이용 시 노출되는 광고게재에 대해 동의하는 것으로 간주한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 12 조 (권리의 귀속)</div>
                <div>1. "서비스"에 대한 저작권 및 지적재산권은 "회사"에 귀속된다. 단, "회원"의 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외된다.</div>
                <div>2. "회사"는 서비스와 관련하여 "회원"에게 "회사"가 정한 이용조건에 따라 계정, 아이디, 콘텐츠 등을 이용할 수 있는 이용권만을 부여하며, "회원"은 이를 양도, 판매, 담보제공 등의 처분행위를 할 수 없다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 13 조 ("회사"의 의무)</div>
                <div>1. "회사"는 본 약관에서 정한 바에 따라 계속적, 안정적으로 서비스를 제공할 수 있도록 최선의 노력을 다해야 한다.</div>
                <div>2. "회사"는 서비스와 관련한 "회원"의 불만사항이 접수되는 경우 이를 즉시 처리하여야 하며, 즉시 처리가 곤란한 경우에는 그 사유와 처리일정을 서비스 또는 기타 방법을 통해 동 "회원"에게 통지하여야 한다.</div>
                <div>3. "회사"는 유료 결제와 관련한 결제 사항 정보를 1년 이상 보존한다. 다만 회원 자격이 없는 회원은 예외로 한다.</div>
                <div>4. 천재지변 등 예측하지 못한 일이 발생하거나 시스템의 장애가 발생하여 서비스가 중단될 경우 이에 대한 손해에 대해서는 "회사"가 책임을 지지 않는다. 다만 자료의 복구나 정상적인 서비스 지원이 되도록 최선을 다할 의무를 진다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 14 조 (회원의 의무)</div>
                <div>1. "회원"은 관계법령과 본 약관의 규정 및 기타 "회사"가 통지하는 사항을 준수하여야 하며, 기타 "회사"의 업무에 방해되는 행위를 해서는 안 된다.</div>
                <div>2. "회원"은 서비스를 이용하여 얻은 정보를 "회사"의 사전동의 없이 복사, 복제, 번역, 출판, 방송 기타의 방법으로 사용하거나 이를 타인에게 제공할 수 없다.</div>
                <div>3. "회원"이 신청한 유료서비스는 등록 또는 신청과 동시에 "회사"와 채권, 채무 관계가 발생하며, "회원"은 이에 대한 요금을 지정한 기일 내에 납부하여야 한다.</div>
                <div>4. "회원"이 결제 수단으로 신용카드를 사용할 경우 비밀번호 등 정보 유실 방지는 "회원" 스스로 관리해야 한다. 단, "사이트"의 결함에 따른 정보유실의 발생에 대한 책임은 "회원"의 의무에 해당하지 아니한다.</div>
                <div>5. "회원"은 본 서비스 이외의 목적으로 사용해서는 안되며 이용 중 다음 각 호의 행위를 해서는 안 된다. 가. 다른 회원의 아이디를 부정 사용하는 행위 나. 범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위 다. 타인의 명예를 훼손하거나 모욕하는 행위 라. 타인의 지적재산권 등의 권리를 침해하는 행위 마. 해킹행위 또는 바이러스의 유포 행위 바. 타인의 의사에 반하여 광고성 정보 등 일정한 내용을 계속적으로 전송하는 행위 사. 서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있다고 판단되는 행위 아. 사이트의 정보 및 서비스를 이용한 영리 행위 자. 그 밖에 선량한 풍속, 기타 사회질서를 해하거나 관계법령을 위반하는 행위</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 15조 (회원탈퇴 및 회원자격 상실)</div>
                <div>1. "회원"은 언제든지 회원탈퇴를 하기 위해 고객센터 또는 회원탈퇴 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며, "회사"는 관련법 등이 정하는 바에 따라 이를 처리한다.</div>
                <div>2. 다음의 사항에 해당하는 경우 "회사"는 사전 동의없이 가입해지나 서비스 중지 및 관련된 컨텐츠 삭제 조치를 취할 수 있다. 가. 회원의 의무를 성실하게 이행하지 않았을 때 나. 규정한 유료서비스 이용 요금을 납부하지 않았을 때 다. 본 서비스 목적에 맞지 않는 분야에 정보를 활용하여 사회적 물의가 발생한 때 라. 회원이 등록한 정보의 내용이 사실과 다르거나 조작되었을 때 마. 본 서비스와 관련하여 회사 또는 제3자의 명예를 훼손하였을 때 바. 기타 위 각호에 준하는 사유가 발생하였을 때</div>
                <div>3. "회사"는 "회원"이 약관 및 서비스 이용약관을 위반한 경우 경고, 일시적 이용정지, 영구적 이용정지 등의 단계로 서비스 이용을 제한하거나 이용계약을 해지할 수 있다.</div>
                <div>4. "회원"은 제 3항에 따른 서비스 이용정지 기타 서비스 이용과 관련된 이용제한에 대하여 "회사"가 정한 절차에 따라 이의신청을 할 수 있으며, "회사"는 "회원"의 이의신청이 정당하다고 판단되는 경우 즉시 서비스 이용을 재개한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 16 조 (손해배상)</div>
                <div>1. 본 서비스 이용과 관련하여 게시된 정보의 오류 및 누락 등에 관한 어떠한 손해에 관하여도 책임을 지지 않는다.</div>
                <div>2. "회원"이 이 약관의 규정에 위반한 행위로 "회사" 및 제3자에게 손해를 입히거나 "회원"의 책임 있는 사유에 의해 "회사" 및 제3자에게 손해를 입힌 경우에는 "회원"은 그 손해를 배상하여야 한다.</div>
                <div>3. 타 회원의 귀책사유로 "회원"의 손해가 발생한 경우 "회사"는 이에 대한 배상 책임이 없다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 17 조 ("회원"의 개인정보보호)</div>
                <div>"회사"는 "회원"의 개인정보보호를 위하여 노력해야 한다. "회원"의 개인정보보호에 관해서는 정보통신망법 및 관계법령에 따르고, "사이트"에 "개인정보처리방침"을 고지한다.</div>
            </div>

            <div class=" space-y-3">
                <div class="text-base text-black font-semibold">제 18 조 (분쟁의 해결)</div>
                <div>1. "회사"와 "회원"은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 한다.</div>
                <div>2. 전항의 노력에도 불구하고, 동 분쟁에 관한 소송은 민사소송법상 관할법원에 제소한다.</div>
            </div>

            <div>※  이 약관은 2021-09-30부터 시행한다.</div>
        </div>
    </div>
</template>

<script>
import {useRouter} from 'vue-router'
import {onBeforeMount} from 'vue'

export default {
    setup() {
        const router = useRouter()

        onBeforeMount(() => {
            window.scrollTo(0, 0)
        })

        const onPrev = () => {
            router.go(-1)
        }

        return {
            onPrev,
        }
    }

}
</script>

<style>

</style>